#Створити функцію яка приймає список [1,2,3,4,5,6,3,4,5,7,6,5,4,3,4,5,4,3, 'Привіт', 'анаконда'].
#Ця функція видаляє всі елементи які повторюються  та повертає список без повторень.
#створюєм функцію яка на вхід буде приймати наш список без повторень та сортувати його.
#Сортування відбувається від найменшого до найбільшого якщо є типи данних типу стр їх в алфавітному порядку встановити після цифр в томуж самомому списку.


#---------------------------------------------------------------------------------------------------------

list1 = [1, 2, 3, 4, 5, 6, 3, 4, 5, 7, 6, 5, 4, 3, 4, 5, 4, 3, 'Привіт', 'анаконда']
print(list1)

#------------------------------------------------------------------------------------------------------
#функції 

def remove_duplicates(list1):
    return list(set(list1))


def sort_list(list1):

    numbers = [item for item in list1 if isinstance(item, int)]
    strings = [item for item in list1 if isinstance(item, str)]
    
    sorted_numbers = sorted(numbers)
    sorted_strings = sorted(strings)
    
    return sorted_numbers + sorted_strings

#----------------------------------------------------------------------------------

unique_list = remove_duplicates(list1)

sorted_list = sort_list(list1)

print("Список без повторень:")
print(unique_list)


print("Відсортований список:")
print(sorted_list)
