#Створити словник з 10 пар ключ значення. Замінити значення в 2 та 7 парі, після чого видалити 3 пару і значення 4 пари

#----------------------------------------------------------
#Словник

slovnic = {
    'k1':'g1',
    'k2':'g2',
    'k3':'g3',
    'k4':'g4',
    'k5':'g5',
    'k6':'g6',
    'k7':'g7',
    'k8':'g8',
    'k9':'g9',
    'k10':'g10',
}

print('словник:')
print(slovnic)

#--------------------------------------------------------------
#Виконання завдання

slovnic['k2'] = 'Y2'
slovnic['k7'] = 'Y7'

del slovnic['k3'] 
slovnic['k4'] = None

print('словник після змін:')
print(slovnic)

#------------------------------------------------------------------